#!/usr/bin/perl
#**************************************************************
# 程序名称：电话查询
# 程序版本：v2.0
# 程序功能描述: 
# 开发人员：莫志兵
# 创建时间：2012-10-10
#**************************************************************
use strict;
use FBI;
use Win32;
use Encode;
use encoding 'euc_cn';
use Win32::API;
kysy();
#******************************************
my %info=(	
#***************************长沙工程
		"刘立"  =>{"分机"=>8063,"短号"=>6788,"手机"=>"187 7498 6788",},
		"李煌"  =>{"分机"=>8052,"短号"=>6626,"手机"=>"182 2999 5366",},
		"李世宏"=>{"分机"=>8052,"短号"=>6935,"手机"=>"188 7481 9335",},
		"胡祥艳"=>{"分机"=>8018,"短号"=>6272,"手机"=>"135 0745 3272",},
		"张放飞"=>{"分机"=>8018,"短号"=>'  ',"手机"=>"135 7408 6857",},
		"谭鹏"  =>{"分机"=>8034,"短号"=>6102,"手机"=>"136 7734 9685",},  
		"谢英"  =>{"分机"=>8034,"短号"=>6251,"手机"=>"135 4866 5251",},	
		"汤斌"  =>{"分机"=>8019,"短号"=>6715,"手机"=>"151 1616 0715",},	 	
		"赵茫"  =>{"分机"=>8019,"短号"=>'  ',"手机"=>"135 4868 4752",},	
#		"李萍"  =>{"分机"=>8067,"短号"=>6968,"手机"=>"137 3905 7963",},
	    "周鑫"  =>{"分机"=>8067,"短号"=>6652,"手机"=>"135 0744 2652",},	
		"王治国"=>{"分机"=>8018,"短号"=>'  ',"手机"=>"182 2980 0534",},	
		"袁喜丰"=>{"分机"=>8018,"短号"=>'  ',"手机"=>"131 3502 0427",},			
		"孟望军"=>{"分机"=>8084,"短号"=>6868,"手机"=>"187 1113 0868",},
		"甘小珍"=>{"分机"=>8084,"短号"=>'  ',"手机"=>"187 1113 0868",},
	    "谈威"  =>{"分机"=>8021,"短号"=>'  ',"手机"=>"188 0740 8705",},
	   #"明加胜"=>{"分机"=>8011,"短号"=>'  ',"手机"=>"155 8096 8663",},	
	   #"吴晓玲"=>{"分机"=>8011,"短号"=>'  ',"手机"=>"158 0251 8563",},		   
#***************************深圳分部
		"黄文cs"=>{"分机"=>8013,"短号"=>'  ',"手机"=>"137 2345 7275",},
 		"杨耀"  =>{"分机"=>8044,"短号"=>'  ',"手机"=>"186 7313 0804",},	
		"李宏"  =>{"分机"=>8100,"短号"=>'  ',"手机"=>"186 7313 3429",},	   
 		"熊力"  =>{"分机"=>8025,"短号"=>'  ',"手机"=>"136 8733 3701",},	
		"彭亮"  =>{"分机"=>8029,"短号"=>'  ',"手机"=>"186 7313 7403",},
		"李佳兴"=>{"分机"=>8030,"短号"=>'  ',"手机"=>"186 8465 7543",},	
		"刘皓宇"=>{"分机"=>8038,"短号"=>'  ',"手机"=>"158 0732 4716",},	
		"谭厂"  =>{"分机"=>8039,"短号"=>'  ',"手机"=>"186 7481 4190",},	
		"胡远勋"=>{"分机"=>8023,"短号"=>'  ',"手机"=>"182 2978 5029",},
		"莫志兵"=>{"分机"=>8013,"短号"=>6512,"手机"=>"139 7511 8512",},
		"曾成龙"=>{"分机"=>8043,"短号"=>'  ',"手机"=>"186 8499 1514",},
		"余波"  =>{"分机"=>8062,"短号"=>'  ',"手机"=>"135 9025 1334",},	
		"谭武"  =>{"分机"=>8023,"短号"=>6465,"手机"=>"152 7486 6465",},
		"徐新"  =>{"分机"=>8085,"短号"=>'  ',"手机"=>"151 7335 1507",},	
		"胡群雄"=>{"分机"=>8071,"短号"=>'  ',"手机"=>"183 7312 7605",},		
		"田宏霞"=>{"分机"=>8044,"短号"=>'  ',"手机"=>"186 8485 0342",},
	    "唐义"  =>{"分机"=>8071,"短号"=>'  ',"手机"=>"180 0252 7134",},
		 "徐灿" =>{"分机"=>8029,"短号"=>'  ',"手机"=>"186 7481 0415",},	
		"戴辉军"=>{"分机"=>8039,"短号"=>'  ',"手机"=>"188 0748 6425",},		
		"李存"  =>{"分机"=>8062,"短号"=>'  ',"手机"=>"187 7400 8951",},	    
		"于容毅"=>{"分机"=>8026,"短号"=>'  ',"手机"=>"151 1103 1510",},			
#***************************订单中心
		"余红军"=>{"分机"=>8059,"短号"=>'  ',"手机"=>"180 0259 6024",},	
		"李素娇"=>{"分机"=>8058,"短号"=>'  ',"手机"=>"152 4368 2499",},
		"涂峥"  =>{"分机"=>8059,"短号"=>6477,"手机"=>"182 7311 0477",},   		
		"黄进"  =>{"分机"=>8015,"短号"=>6168,"手机"=>"150 8483 2068",},	   
		"王玉玲"=>{"分机"=>8097,"短号"=>6840,"手机"=>"135 4964 7840",},    		
		"游梦婷"=>{"分机"=>8060,"短号"=>'  ',"手机"=>"151 1621 3098",},	   
		"周佳"  =>{"分机"=>8060,"短号"=>'  ',"手机"=>"136 8733 2251",}, 				
		"刘玮"  =>{"分机"=>8097,"短号"=>'  ',"手机"=>"158 0258 4550",}, 	
		"陈登凯"=>{"分机"=>8016,"短号"=>'  ',"手机"=>"158 7494 7667",},    
		"周莹莹"=>{"分机"=>8014,"短号"=>'  ',"手机"=>"188 7477 7875",},   				
		"石湘"  =>{"分机"=>8016,"短号"=>'  ',"手机"=>"158 7313 4510",},   	
		"薛灿"  =>{"分机"=>8015,"短号"=>'  ',"手机"=>"158 0260 7030",},		
		"张庭"  =>{"分机"=>8014,"短号"=>6840,"手机"=>"137 8366 3780",}, 				
		"刘司文"=>{"分机"=>8046,"短号"=>6840,"手机"=>"135 4875 6454",}, 			
		"吴凤姣"=>{"分机"=>8091,"短号"=>'  ',"手机"=>"187 7487 7521",},    		
		"刘琴"  =>{"分机"=>8022,"短号"=>'  ',"手机"=>"158 7403 6530",},   						
		"杨端"  =>{"分机"=>8046,"短号"=>'  ',"手机"=>"153 8806 4697",},   		
		"霭新爽"=>{"分机"=>8022,"短号"=>'  ',"手机"=>"151 1137 3982",},				
		"扶彬"  =>{"分机"=>8027,"短号"=>'  ',"手机"=>"151 1626 6715",}, 
#***************************外销二部
		"颜更生"=>{"分机"=>8070,"短号"=>'  ',"手机"=>"139 2742 2760",},	 
		"李姗"  =>{"分机"=>8056,"短号"=>'  ',"手机"=>"151 7328 6034",},   
		"丁晓燕"=>{"分机"=>8033,"短号"=>'  ',"手机"=>"187 0749 2238",},   		
		"谭新珠"=>{"分机"=>8033,"短号"=>'  ',"手机"=>"131 8708 9585",},
		"覃芳萍"=>{"分机"=>"813深","短号"=>'  ',"手机"=>"135 7081 5589",},   
					
 #***************************深圳工程
		"黄文"  =>{"分机"=>852,"短号"=>68375,"手机"=>"137 2345 7275",},
		"胡建波"=>{"分机"=>846,"短号"=>68118,"手机"=>"134 1042 6118",},
		 "于勇" =>{"分机"=>835,"短号"=>68872,"手机"=>"152 2012 5872",},
		"唐秀艳"=>{"分机"=>874,"短号"=>'   ',"手机"=>"137 2436 1421",},
		"谢东波"=>{"分机"=>846,"短号"=>6816, "手机"=>"151 1262 7816",},
		"陈雪娇"=>{"分机"=>835,"短号"=>68407,"手机"=>"159 1537 7905",},
		"熊丽娟"=>{"分机"=>844,"短号"=>'  ', "手机"=>"150 1265 1560",},
		"左银芳"=>{"分机"=>844,"短号"=>'  ', "手机"=>"159 8951 7269",},
		"祝顺民"=>{"分机"=>862,"短号"=>'  ', "手机"=>"186 7584 2025",},
		"邓敏"  =>{"分机"=>862,"短号"=>68311,"手机"=>"135 1078 0294",},
		"封学鹏"=>{"分机"=>838,"短号"=>'  ', "手机"=>"158 1374 4179",},
	    "丁迎来"=>{"分机"=>844,"短号"=>'  ', "手机"=>"155 8096 8663",},	
		"徐片冰"=>{"分机"=>841,"短号"=>68890,"手机"=>"150 1402 4890",},	
		"欧江"  =>{"分机"=>841,"短号"=>'  ', "手机"=>"134 2791 4233",},
		"肖明"  =>{"分机"=>845,"短号"=>'  ', "手机"=>"132 4671 2244",},
	    "肖礼俊"=>{"分机"=>875,"短号"=>'  ', "手机"=>"155 8096 8663",},	
		"吴晓文"=>{"分机"=>876,"短号"=>'  ', "手机"=>"150 1347 9757",},
 		"程明"  =>{"分机"=>875,"短号"=>68217,"手机"=>"134 2436 0217",},
	    "曾乐"  =>{"分机"=>875,"短号"=>68810,"手机"=>"158 1864 2882",},	
 		"方波"  =>{"分机"=>859,"短号"=>68582,"手机"=>"136 1302 8657",},
	    "潘远航"=>{"分机"=>859,"短号"=>68065,"手机"=>"159 1400 8065",},		
		"阳滔"  =>{"分机"=>859,"短号"=>6875 ,"手机"=>"135 9021 8775",},
		"王群"  =>{"分机"=>876,"短号"=>'   ',"手机"=>"151 0202 8782",},		
		"聂集平"=>{"分机"=>838,"短号"=>'   ',"手机"=>"153 6150 4901",},	
 #***************************莱奥工程
		"刘福彪"=>{"分机"=>8095,"短号"=>'  ',"手机"=>"186 6250 7501",},
		"陈小莉"=>{"分机"=>8096,"短号"=>'  ',"手机"=>"187 7316 4787",},
		"吴立"	=>{"分机"=>8083,"短号"=>'  ',"手机"=>"186 8486 8707",},
		"张洁"	=>{"分机"=>8095,"短号"=>'  ',"手机"=>"131 0721 1737",},
		"邹伟平"=>{"分机"=>8095,"短号"=>'  ',"手机"=>"151 7324 9422",},  
	    "杜玲丽"=>{"分机"=>8095,"短号"=>'  ',"手机"=>".............",}, 	
		"雷伟"	=>{"分机"=>8083,"短号"=>'  ',"手机"=>"139 7420 0038",},	
		"邹方"	=>{"分机"=>8083,"短号"=>'  ',"手机"=>"186 8484 8673",},	
	    "李胜楚"=>{"分机"=>8083,"短号"=>'  ',"手机"=>"182 2992 5356",},
        "吴理松"=>{"分机"=>8083,"短号"=>'  ',"手机"=>"187 7009 8956",},
		"黄两"  =>{"分机"=>8083,"短号"=>'  ',"手机"=>"158 7329 1294",},
		"王浪"  =>{"分机"=>8096,"短号"=>'  ',"手机"=>"182 7483 1895",},
		"陈澄"  =>{"分机"=>8096,"短号"=>'  ',"手机"=>"158 7402 7934",},
		"邓良新"=>{"分机"=>8096,"短号"=>'  ',"手机"=>"138 9366 4537",},	
 );
###深圳地区，长沙地区，莱奥分部，长沙分部
 my (@sales,@cseng,@sceng,@szeng,@laeng,@out_sale);
 my ($outsaname,$salesname,$csengname,$scengname,$szengname,$laengname,)=("颜更生","余红军","刘立","杨耀","于勇","刘福彪",);

@sales=qw(余红军 李素娇 涂峥 黄进 王玉玲 游梦婷 
		  周佳 刘玮 陈登凯 周莹莹 石湘 薛灿 张庭 
		  刘司文 吴凤姣 刘琴 杨端 霭新爽 扶彬);

@out_sale=qw(颜更生 李姗 丁晓燕 谭新珠 覃芳萍);

@cseng=qw(刘立 李煌 李世宏 胡祥艳
		  张放飞 谭鹏 谢瑛 汤斌 赵茫 李萍
		  周鑫 王治国 袁喜丰 孟望军 甘小珍 谈威);

@sceng=qw(黄文 莫志兵 杨耀  田宏霞 
		  于容毅 谭武 胡远勋 曾成龙 唐义 胡群雄 
		  彭亮 徐灿  熊力 余波 李存 李佳兴  谭厂 
		  戴辉军 李宏 徐新  刘皓宇 );

@szeng=qw(黄文 谢东波 胡建波  陈雪娇 于勇 唐秀艳 
          熊丽娟 左银芳 邓敏  封学鹏 丁迎来 徐片冰
		  王群 欧江 肖明   肖礼俊 吴晓文 程明 
		  曾乐 方波 潘远航 阳滔  聂集平);

@laeng=qw(刘福彪 张洁 邹伟平 杜玲丽 吴立 
			雷伟 邹方 李胜楚 吴理松 黄两 
			王浪 陈小莉 陈澄 邓良新);

my $mw = MainWindow->new;
$mw->geometry("+400+250");

$mw->update;
Win32::API->new("user32","SetWindowPos",[qw(N N N N N N N)],'N')->Call(hex($mw->frame()),-1,0,0,0,0,3);
$mw->title("电话查询——新版2.0");
$mw->Optionmenu(-options =>[@out_sale],-font =>[-size => 14],-textvariable=>\$outsaname,-width=>8)->grid(-column=>0,-row=>0);
$mw->Button(-text=>'外销二部',-command=>\&osquery,-font =>[-size =>14],-width=>12)->grid(-column=>1,-row=>0,-sticky=>"ew",);


$mw->Optionmenu(-options =>[@sales],-font =>[-size => 14],-textvariable=>\$salesname,-width=>8)->grid(-column=>0,-row=>1);
$mw->Button(-text=>'订单中心',-command=>\&saquery,-font =>[-size =>14],-width=>12)->grid(-column=>1,-row=>1,-sticky=>"ew",);

$mw->Optionmenu(-options =>[@cseng],-font =>[-size => 14],-textvariable=>\$csengname,-width=>8)->grid(-column=>0,-row=>2);
$mw->Button(-text=>'长沙地区',-command=>\&csquery,-font =>[-size =>14],-width=>12)->grid(-column=>1,-row=>2,-sticky=>"ew",);

$mw->Optionmenu(-options =>[@sceng],-font =>[-size => 14],-textvariable=>\$scengname,-width=>8)->grid(-column=>0,-row=>3);
$mw->Button(-text=>'长沙分部',-command=>\&scquery,-font =>[-size =>14],-width=>12)->grid(-column=>1,-row=>3,-sticky=>"ew",);

$mw->Optionmenu(-options =>[@szeng],-font =>[-size => 14],-textvariable=>\$szengname,-width=>8)->grid(-column=>0,-row=>4);

$mw->Button(-text=>'深圳地区',-command=>\&szquery,-font =>[-size =>14],-width=>12)->grid(-column=>1,-row=>4,-sticky=>"ew",);

$mw->Optionmenu(-options =>[@laeng],-font =>[-size => 14],-textvariable=>\$laengname,-width=>8)->grid(-column=>0,-row=>5);
$mw->Button(-text=>'莱奥分部',-command=>\&laquery,-font =>[-size =>14],-width=>12)->grid(-column=>1,-row=>5,-sticky=>"ew",);

$mw->Label(-text=>"长沙:",-relief=>'g',	-font =>[-size => 14],-width=>6)  ->grid(-column=>3,-row=>0);
$mw->Label(-text=>"深圳:",-relief=>'g', -font =>[-size => 14],-width=>6)  ->grid(-column=>3,-row=>1);
$mw->Label(-text=>"姓名:",-relief=>'g',	-font =>[-size => 14],-width=>6)  ->grid(-column=>3,-row=>2);
$mw->Label(-text=>"分机:",-relief=>'g', -font =>[-size => 14],-width=>6)  ->grid(-column=>3,-row=>3);
$mw->Label(-text=>"短号:",-relief=>'g', -font =>[-size => 14],-width=>6)  ->grid(-column=>3,-row=>4);
$mw->Label(-text=>"手机:",-relief=>'g',	-font =>[-size => 14],-width=>6)  ->grid(-column=>3,-row=>5);

$mw->Label(-text=>"0731-82786288",-relief=>'g',	-font =>[-size => 14],-width=>14)  ->grid(-column=>4,-row=>0);
$mw->Label(-text=>"0755-33934688",-relief=>'g', -font =>[-size => 14],-width=>14)  ->grid(-column=>4,-row=>1);

MainLoop;

sub osquery {
	$mw->Label(-background => "cornsilk",-text=>$outsaname,-relief=>'g',-font =>[-family=>'黑体',-size => 14],-width=>14) ->grid(-column=>4,-row=>2);
	$mw->Label(-background => "cornsilk",-text=>$info{$outsaname}{"分机"},-relief=>'g',-font =>[-size => 14],-width=>14) ->grid(-column=>4,-row=>3);
	$mw->Label(-background => "cornsilk",-text=>$info{$outsaname}{"短号"},-relief=>'g',-font =>[-size => 14],-width=>14) ->grid(-column=>4,-row=>4);
	$mw->Label(-background => "cornsilk",-text=>$info{$outsaname}{"手机"},-relief=>'g',-font =>[-size => 14],-width=>14) ->grid(-column=>4,-row=>5);
	}

sub saquery {
	$mw->Label(-background => "azure",-text=>$salesname,-relief=>'g',-font =>[-family=>'黑体',-size => 14],-width=>14) ->grid(-column=>4,-row=>2);
	$mw->Label(-background => "azure",-text=>$info{$salesname}{"分机"},-relief=>'g',     -font =>[-size => 14],-width=>14) ->grid(-column=>4,-row=>3);
	$mw->Label(-background => "azure",-text=>$info{$salesname}{"短号"},-relief=>'g',     -font =>[-size => 14],-width=>14) ->grid(-column=>4,-row=>4);
	$mw->Label(-background => "azure",-text=>$info{$salesname}{"手机"},-relief=>'g',     -font =>[-size => 14],-width=>14) ->grid(-column=>4,-row=>5);
	}

sub csquery {
	$mw->Label(-background => "seashell",-text=>$csengname,-relief=>'g',-font =>[-family=>'黑体',-size => 14],-width=>14) ->grid(-column=>4,-row=>2);
	$mw->Label(-background => "seashell",-text=>$info{$csengname}{"分机"},-relief=>'g',     -font =>[-size => 14],-width=>14) ->grid(-column=>4,-row=>3);
	$mw->Label(-background => "seashell",-text=>$info{$csengname}{"短号"},-relief=>'g',     -font =>[-size => 14],-width=>14) ->grid(-column=>4,-row=>4);
	$mw->Label(-background => "seashell",-text=>$info{$csengname}{"手机"},-relief=>'g',     -font =>[-size => 14],-width=>14) ->grid(-column=>4,-row=>5);
	}

sub scquery {
	$mw->Label(-background => "honeydew",-text=>$scengname,-relief=>'g',-font =>[-family=>'黑体',-size => 14],-width=>14) ->grid(-column=>4,-row=>2);
	$mw->Label(-background => "honeydew",-text=>$info{$scengname}{"分机"},-relief=>'g',     -font =>[-size => 14],-width=>14) ->grid(-column=>4,-row=>3);
	$mw->Label(-background => "honeydew",-text=>$info{$scengname}{"短号"},-relief=>'g',     -font =>[-size => 14],-width=>14) ->grid(-column=>4,-row=>4);
	$mw->Label(-background => "honeydew",-text=>$info{$scengname}{"手机"},-relief=>'g',     -font =>[-size => 14],-width=>14) ->grid(-column=>4,-row=>5);
	}

sub szquery {
	$mw->Label(-background => "ghostwhite",-text=>$szengname,-relief=>'g',-font =>[-family=>'黑体',-size => 14],-width=>14) ->grid(-column=>4,-row=>2);
	$mw->Label(-background => "ghostwhite",-text=>$info{$szengname}{"分机"},-relief=>'g',     -font =>[-size => 14],-width=>14) ->grid(-column=>4,-row=>3);
	$mw->Label(-background => "ghostwhite",-text=>$info{$szengname}{"短号"},-relief=>'g',     -font =>[-size => 14],-width=>14) ->grid(-column=>4,-row=>4);
	$mw->Label(-background => "ghostwhite",-text=>$info{$szengname}{"手机"},-relief=>'g',     -font =>[-size => 14],-width=>14) ->grid(-column=>4,-row=>5);
	}

sub laquery {
	$mw->Label(-background => "mistyrose",-text=>$laengname,-relief=>'g',-font =>[-family=>'黑体',-size => 14],-width=>14) ->grid(-column=>4,-row=>2);
	$mw->Label(-background => "mistyrose",-text=>$info{$laengname}{"分机"},-relief=>'g',     -font =>[-size => 14],-width=>14) ->grid(-column=>4,-row=>3);
	$mw->Label(-background => "mistyrose",-text=>$info{$laengname}{"短号"},-relief=>'g',     -font =>[-size => 14],-width=>14) ->grid(-column=>4,-row=>4);
	$mw->Label(-background => "mistyrose",-text=>$info{$laengname}{"手机"},-relief=>'g',	  -font =>[-size => 14],-width=>14) ->grid(-column=>4,-row=>5);
	}











